### Merging Multiple Datasets

We can merge datasets when,

- we have multiple small datasets
- We need a large dataset for deep learning

#### Problem Statement:
    
Predicting weight of person based on his/her height. Using height and weight datsets.

#### Datasets

https://www.kaggle.com/datasets/mustafaali96/weight-height
    
https://www.kaggle.com/datasets/burnoutminer/heights-and-weights-dataset

#### Things to keep in mind

- Number of features (Tabular)/characterisitcs (Image) in datasets
- Unit of each feature value. 
    - Ex. Height in inches, cm, meter, feets.
- distribution of data - Is data set balanced one?

##### For example, we are solving a classification problem and we are having a data related to male and female. Then we have to make sure that if we are trying to classify based on the characterstics like whether this record is related to male or female. In that we need to make sure that we have a balanced data i.e. each class is having similar number of records in the dataset.

In [1]:
import pandas as pd

#### Dataset1

In [4]:
url1 = 'https://raw.githubusercontent.com/shanmukha6959/Exploratory_Data_Analysis/main/Dataset/height_weight_dataset1.csv'
df1 = pd.read_csv(url1)
df1

       Index  Height(Inches)  Weight(Pounds)
0          1        65.78331        112.9925
1          2        71.51521        136.4873
2          3        69.39874        153.0269
3          4        68.21660        142.3354
4          5        67.78781        144.2971
...      ...             ...             ...
24995  24996        69.50215        118.0312
24996  24997        64.54826        120.1932
24997  24998        64.69855        118.2655
24998  24999        67.52918        132.2682
24999  25000        68.87761        124.8742

[25000 rows x 3 columns]

#### Dataset2

In [6]:
url2 = 'https://raw.githubusercontent.com/shanmukha6959/Exploratory_Data_Analysis/main/Dataset/height_weight_dataset2.csv'
df2 = pd.read_csv(url2)
df2

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [11]:
display(df1.head(), df2.head())

   Index  Height(Inches)  Weight(Pounds)
0      1        65.78331        112.9925
1      2        71.51521        136.4873
2      3        69.39874        153.0269
3      4        68.21660        142.3354
4      5        67.78781        144.2971

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

#### Handling Features

##### Dropping features/columns that are not reuqired

In [12]:
display(df1.head())
df1.drop(columns= ['Index'], inplace=True)
display(df1.head())

   Index  Height(Inches)  Weight(Pounds)
0      1        65.78331        112.9925
1      2        71.51521        136.4873
2      3        69.39874        153.0269
3      4        68.21660        142.3354
4      5        67.78781        144.2971

   Height(Inches)  Weight(Pounds)
0        65.78331        112.9925
1        71.51521        136.4873
2        69.39874        153.0269
3        68.21660        142.3354
4        67.78781        144.2971

In [13]:
display(df2.head())
df2.drop(columns= ['Gender'], inplace=True)
display(df2.head())

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

      Height      Weight
0  73.847017  241.893563
1  68.781904  162.310473
2  74.110105  212.740856
3  71.730978  220.042470
4  69.881796  206.349801

##### Rename Feature/column names

- To make sure all the column names for all the datasets are similar.

In [14]:
df2.rename(columns = {'Height':'Height(Inches)', 'Weight':'Weight(Pounds)'}, inplace=True)
df2.head()

   Height(Inches)  Weight(Pounds)
0       73.847017      241.893563
1       68.781904      162.310473
2       74.110105      212.740856
3       71.730978      220.042470
4       69.881796      206.349801

In [15]:
display(df1.head(), df2.head())

   Height(Inches)  Weight(Pounds)
0        65.78331        112.9925
1        71.51521        136.4873
2        69.39874        153.0269
3        68.21660        142.3354
4        67.78781        144.2971

   Height(Inches)  Weight(Pounds)
0       73.847017      241.893563
1       68.781904      162.310473
2       74.110105      212.740856
3       71.730978      220.042470
4       69.881796      206.349801

In [16]:
display(df1.shape, df2.shape)

(25000, 2)

(10000, 2)

##### Merge both datasets

In [20]:
df_merge = pd.concat([df1, df2])
df_merge

      Height(Inches)  Weight(Pounds)
0          65.783310      112.992500
1          71.515210      136.487300
2          69.398740      153.026900
3          68.216600      142.335400
4          67.787810      144.297100
...              ...             ...
9995       66.172652      136.777454
9996       67.067155      170.867906
9997       63.867992      128.475319
9998       69.034243      163.852461
9999       61.944246      113.649103

[35000 rows x 2 columns]

#### Alternatives

- Data Augmentation
    - Data is in the form of a images and it is very small. To increase the size of data using data augmentation we can increase the number of images required for the project by using the same image it will just flip it out or recline or decline by creating multiple images. 
- Use another data set as test or validation data